#!/bin/bash

# ----------------------------------------------------
# 1. УСТАНОВКА ПРАВ ДОСТУПА К СКРИПТУ ENTRYPOINT (Решает ошибку запуска)
# ----------------------------------------------------
# Убедимся, что скрипт исполняем. Эта команда должна стоять первой.
chmod +x /app/entrypoint.sh

# ----------------------------------------------------
# 2. ОЖИДАНИЕ БАЗЫ ДАННЫХ
# ----------------------------------------------------
echo "Ожидание PostgreSQL..."

while ! nc -z db 5432; do
  sleep 0.5
done

echo "PostgreSQL запущен!"

# ----------------------------------------------------
# 3. УСТАНОВКА ПРАВ ДОСТУПА К ТОМАМ (Решает Permission denied Django)
# ----------------------------------------------------
# Применяем права к смонтированным томам, чтобы appuser мог писать в них.
echo "Установка прав доступа (775) для смонтированных томов media и staticfiles..."
chmod -R 775 /app/media
chmod -R 775 /app/staticfiles

# ----------------------------------------------------
# 4. ПОДГОТОВКА (Миграции и Статика)
# ----------------------------------------------------
echo "Применение миграций Django..."
python manage.py makemigrations --noinput

echo "Применение миграций Django..."
python manage.py migrate --noinput

echo "Сбор статических файлов..."
python manage.py collectstatic --noinput

# ----------------------------------------------------
# 5. ЗАПУСК GUNICORN
# ----------------------------------------------------
echo "Запуск Gunicorn..."
exec gosu appuser gunicorn interact.wsgi:application --bind 0.0.0.0:8000 --workers 3