#!/bin/bash

# ----------------------------------------------------
# 1. УСТАНОВКА ПРАВ ДОСТУПА К СКРИПТУ ENTRYPOINT
# ----------------------------------------------------
chmod +x /app/entrypoint.sh

# ----------------------------------------------------
# 2. АВТО-УСТАНОВКА И ОБНОВЛЕНИЕ ПАКЕТОВ ЧЕРЕЗ UV
# ----------------------------------------------------
echo "Проверка и установка зависимостей через uv..."
uv pip install --system -r requirements.txt --extra-index-url https://download.pytorch.org/whl/cpu

# ----------------------------------------------------
# 3. ОЖИДАНИЕ БАЗЫ ДАННЫХ
# ----------------------------------------------------
echo "Ожидание PostgreSQL..."
while ! nc -z db 5432; do
  sleep 0.5
done
echo "PostgreSQL запущен!"

# ----------------------------------------------------
# 4. УСТАНОВКА ПРАВ ДОСТУПА К ТОМАМ (ФИКС ОШИБКИ ПРАВ)
# ----------------------------------------------------
echo "Установка прав доступа (775) для смонтированных томов media и staticfiles..."
# Убеждаемся, что appuser — владелец смонтированных томов
chown -R appuser:appuser /app/media
chown -R appuser:appuser /app/staticfiles
chmod -R 775 /app/media
chmod -R 775 /app/staticfiles

# ----------------------------------------------------
# 5. ПОДГОТОВКА (Миграции и Статика)
# ----------------------------------------------------
echo "Создание новых миграций (если есть)..."
python manage.py makemigrations --noinput

echo "Применение миграций Django..."
python manage.py migrate --noinput

echo "Сбор статических файлов..."
python manage.py collectstatic --noinput

# ----------------------------------------------------
# 6. ЗАПУСК GUNICORN
# ----------------------------------------------------
echo "Запуск Gunicorn..."
exec gosu appuser gunicorn interact.wsgi:application --bind 0.0.0.0:8000 --workers 3